#include <stdio.h>

int main(int argc, char **argv)
{
    int a = 10;
    int d = 20;
    int e = 30;
    char b = 'c';
    float c = 20.5;

    int array[10] = {12, 23, 34, 45, 56, 67, 78};
    

    //////////////////////////////////////////////////////////////
    // 数组的缺点：
    //
    //    1.一旦数组定义，则大小固定，无法进行修改（数组的大小）。
    //    2.数组插入和删除的效率太低，时间复杂度O（n）。
    //    
    // 数组的优点：
    //    
    //    1.下标访问，速度快，时间复杂度是O（1）
    //
    //////////////////////////////////////////////////////////////
    //
    // 链表：
    //   
    //    1.链表节点的两个组成部分：
    //        数据域
    //        指针域
    //    2.如何把两个链表节点进行链接（A和B）？
    //        让A的指针域记录下B节点的地址
    //
    // 链表的优点：
    //   
    //    1.资源允许的情况下，规模可以不断的增长或减小。
    //    2.删除和添加效率高，O（1）
    //
    // 链表的缺点：
    //
    //    链表的遍历过程效率比较低。
    //////////////////////////////////////////////////////////////       
    //   
    //
    //
    //    typedef struct Node{
    //        //数据域
    //        char name[20];姓名
    //        char sex; m 男 w 女 性别
    //        char age;年龄
    //        char jobs[20];职业
    //        //链域
    //        struct Node *next;
    //    }Node;
    Node node1 = {0};
    //申请一个链表节点
    Node *p_node = (Node *)malloc(sizeof(Node));

    node1.next = p_node;

        

   

    return 0;
}
